// 张树垚 2016-04-06 15:34:33 创建
// 状态码和提示语


define('check-message', function() {
	var message;
	return message = { // 提示语
		'200': '验证成功',
		'310': '请输入正确的手机号',
		'311': '手机号不能为空',
		'320': '密码格式错误',
		'321': '密码不能为空',
		'322': '非6-20位字符',
		'323': '只能包含字母、数字以及标点符号（除空格）',
		'324': '大写字母、小写字母、数字以和标点符号至少两种',
		'330': '支付密码格式错误',
		'331': '不是六位数字',
		'332': '六位相同数字',
		'333': '六位连续数字',
		'340': '请输入正确的验证码',
		result: function(code) {
			return {
				result: code === '200',
				code: code,
				message: message[code]
			};
		},
	};
});